"""
Скрипт для генерации инструкции пользователя в формате Word
"""
from docx import Document
from docx.shared import Pt, Inches, RGBColor
from docx.enum.text import WD_ALIGN_PARAGRAPH
from docx.oxml.ns import qn
from docx.oxml import OxmlElement

def add_heading(doc, text, level=1):
    """Добавить заголовок"""
    heading = doc.add_heading(text, level=level)
    heading.style.font.size = Pt(14 if level == 1 else 12)
    return heading

def add_paragraph_bold(doc, text):
    """Добавить жирный абзац"""
    p = doc.add_paragraph()
    run = p.add_run(text)
    run.bold = True
    return p

def add_bullet_point(doc, text, level=0):
    """Добавить маркированный пункт"""
    p = doc.add_paragraph(text, style='List Bullet' if level == 0 else 'List Bullet 2')
    return p

def add_numbered_point(doc, text):
    """Добавить нумерованный пункт"""
    p = doc.add_paragraph(text, style='List Number')
    return p

def create_user_manual():
    """Создать инструкцию пользователя"""
    doc = Document()
    
    # Настройка стилей документа
    style = doc.styles['Normal']
    font = style.font
    font.name = 'Times New Roman'
    font.size = Pt(12)
    
    # Заголовок документа
    title = doc.add_heading('Инструкция пользователя', 0)
    title.alignment = WD_ALIGN_PARAGRAPH.CENTER
    
    subtitle = doc.add_paragraph('Телеграм-бот менеджера по закупкам РМКСИБ')
    subtitle.alignment = WD_ALIGN_PARAGRAPH.CENTER
    subtitle_run = subtitle.runs[0]
    subtitle_run.font.size = Pt(14)
    subtitle_run.bold = True
    
    doc.add_paragraph()
    
    # Содержание
    add_heading(doc, 'Содержание', 1)
    doc.add_paragraph('1. Введение')
    doc.add_paragraph('2. Настройка и установка')
    doc.add_paragraph('3. Первый запуск и регистрация')
    doc.add_paragraph('4. Основные функции бота')
    doc.add_paragraph('5. Работа с лотами')
    doc.add_paragraph('6. Анализ коммерческих предложений')
    doc.add_paragraph('7. Поиск поставщиков')
    doc.add_paragraph('8. Настройки пользователя')
    doc.add_paragraph('9. Статистика')
    doc.add_paragraph('10. Административные функции')
    doc.add_paragraph('11. Решение проблем')
    doc.add_paragraph('12. Часто задаваемые вопросы')
    
    doc.add_page_break()
    
    # 1. Введение
    add_heading(doc, '1. Введение', 1)
    doc.add_paragraph(
        'Телеграм-бот менеджера по закупкам РМКСИБ — это AI-ассистент для автоматизации '
        'процессов управления закупками. Бот помогает менеджерам по закупкам эффективно '
        'работать с лотами, анализировать коммерческие предложения, находить поставщиков '
        'и получать уведомления о новых закупках.'
    )
    
    add_paragraph_bold(doc, 'Основные возможности:')
    add_bullet_point(doc, 'Управление закупками (лоты, парсинг, фильтрация)')
    add_bullet_point(doc, 'AI-анализ лотов через Perplexity')
    add_bullet_point(doc, 'Email уведомления с фильтрацией')
    add_bullet_point(doc, 'Анализ коммерческих предложений')
    add_bullet_point(doc, 'Статистика по лотам, КП, поставщикам, пользователям')
    add_bullet_point(doc, 'База поставщиков с рейтингами')
    add_bullet_point(doc, 'GUI-настройки пользователей')
    add_bullet_point(doc, 'Поиск поставщиков через AI и внешние API')
    
    doc.add_paragraph()
    
    # 2. Настройка и установка
    add_heading(doc, '2. Настройка и установка', 1)
    
    add_heading(doc, '2.1. Требования', 2)
    doc.add_paragraph('Для работы с ботом вам потребуется:')
    add_bullet_point(doc, 'Учетная запись Telegram')
    add_bullet_point(doc, 'Доступ к интернету')
    add_bullet_point(doc, 'Для администраторов: доступ к серверу развертывания бота')
    
    add_heading(doc, '2.2. Получение доступа к боту', 2)
    doc.add_paragraph(
        'Для получения доступа к боту обратитесь к администратору системы. '
        'Вам будет предоставлен токен бота или ссылка для подключения.'
    )
    
    add_heading(doc, '2.3. Первый запуск (для администраторов)', 2)
    doc.add_paragraph(
        'Если вы администратор и настраиваете бота впервые, выполните следующие шаги:'
    )
    
    add_numbered_point(doc, 'Установите зависимости:')
    code_p = doc.add_paragraph('pip install -r requirements.txt', style='No Spacing')
    code_run = code_p.runs[0]
    code_run.font.name = 'Courier New'
    code_run.font.size = Pt(10)
    
    add_numbered_point(doc, 'Создайте файл .env в корне проекта:')
    doc.add_paragraph('Скопируйте .env.example в .env и заполните необходимые параметры:')
    code_p = doc.add_paragraph(
        'BOT_TOKEN=your_bot_token_here\n'
        'REDIS_URL=redis://localhost:6379/0\n'
        'POSTGRES_HOST=localhost\n'
        'POSTGRES_PORT=5432\n'
        'POSTGRES_DB=procurement\n'
        'POSTGRES_USER=procure_user\n'
        'POSTGRES_PASSWORD=change_me\n'
        'PERPLEXITY_API_KEY=your_perplexity_key\n'
        'NOTIFY_EMAILS=["email1@example.com", "email2@example.com"]',
        style='No Spacing'
    )
    code_run = code_p.runs[0]
    code_run.font.name = 'Courier New'
    code_run.font.size = Pt(9)
    
    add_numbered_point(doc, 'Запустите Docker Compose:')
    code_p = doc.add_paragraph('docker compose up -d', style='No Spacing')
    code_run = code_p.runs[0]
    code_run.font.name = 'Courier New'
    code_run.font.size = Pt(10)
    
    add_numbered_point(doc, 'Примените миграции базы данных:')
    code_p = doc.add_paragraph('alembic upgrade head', style='No Spacing')
    code_run = code_p.runs[0]
    code_run.font.name = 'Courier New'
    code_run.font.size = Pt(10)
    
    add_numbered_point(doc, 'Создайте первого администратора:')
    doc.add_paragraph('Узнайте свой Telegram ID через бота @userinfobot, затем выполните:')
    code_p = doc.add_paragraph('python scripts/create_admin.py YOUR_TELEGRAM_ID', style='No Spacing')
    code_run = code_p.runs[0]
    code_run.font.name = 'Courier New'
    code_run.font.size = Pt(10)
    
    add_numbered_point(doc, 'Запустите бота:')
    code_p = doc.add_paragraph('python -m bot.main', style='No Spacing')
    code_run = code_p.runs[0]
    code_run.font.name = 'Courier New'
    code_run.font.size = Pt(10)
    
    doc.add_paragraph()
    
    # 3. Первый запуск и регистрация
    add_heading(doc, '3. Первый запуск и регистрация', 1)
    
    doc.add_paragraph(
        'При первом обращении к боту выполните следующие действия:'
    )
    
    add_numbered_point(doc, 'Найдите бота в Telegram по имени или ссылке, предоставленной администратором')
    
    add_numbered_point(doc, 'Отправьте команду /start')
    doc.add_paragraph(
        'Бот автоматически зарегистрирует вас в системе и отобразит приветственное сообщение '
        'с главным меню.'
    )
    
    add_numbered_point(doc, 'Проверьте свою информацию командой /user_info')
    doc.add_paragraph(
        'Команда покажет ваш Telegram ID, имя, роль и другую информацию о вашем аккаунте.'
    )
    
    add_paragraph_bold(doc, 'Главное меню бота включает следующие кнопки:')
    add_bullet_point(doc, '📋 Мои лоты — просмотр и управление закупками')
    add_bullet_point(doc, '📊 Статистика — общая статистика системы')
    add_bullet_point(doc, '📄 Анализ КП — анализ коммерческих предложений')
    add_bullet_point(doc, '🔍 Поиск Поставщиков — поиск поставщиков через AI')
    add_bullet_point(doc, '➕ Создать лот — создание лота вручную')
    add_bullet_point(doc, '⚙️ Настройки — настройки пользователя')
    add_bullet_point(doc, '👑 Админ-панель — доступна только администраторам')
    
    doc.add_paragraph()
    
    # 4. Основные функции бота
    add_heading(doc, '4. Основные функции бота', 1)
    
    add_heading(doc, '4.1. Команды бота', 2)
    doc.add_paragraph('Бот поддерживает следующие текстовые команды:')
    
    add_paragraph_bold(doc, 'Основные команды:')
    add_bullet_point(doc, '/start — запуск бота, регистрация')
    add_bullet_point(doc, '/help — справка по командам')
    add_bullet_point(doc, '/user_info — информация о вашем аккаунте')
    
    add_paragraph_bold(doc, 'Команды настроек:')
    add_bullet_point(doc, '/notify_on — включить уведомления')
    add_bullet_point(doc, '/notify_off — выключить уведомления')
    add_bullet_point(doc, '/set_email <email> — указать email для уведомлений')
    add_bullet_point(doc, '/set_customers <список> — выбрать заказчиков для фильтрации')
    add_bullet_point(doc, '/set_nomenclature <список> — выбрать номенклатуру для фильтрации')
    add_bullet_point(doc, '/show_prefs — показать текущие настройки')
    
    add_paragraph_bold(doc, 'Команды анализа:')
    add_bullet_point(doc, '/analyze <lot_number> — анализ лота через Perplexity AI')
    add_bullet_point(doc, '/mail_analysis <lot_number> — отправить анализ лота на email')
    
    doc.add_paragraph()
    
    # 5. Работа с лотами
    add_heading(doc, '5. Работа с лотами', 1)
    
    add_heading(doc, '5.1. Просмотр лотов', 2)
    doc.add_paragraph(
        'Для просмотра доступных лотов нажмите кнопку "📋 Мои лоты" в главном меню. '
        'Бот отобразит список лотов с учетом ваших настроек фильтрации.'
    )
    
    doc.add_paragraph(
        'Лоты отображаются с информацией о:'
    )
    add_bullet_point(doc, 'Номере лота')
    add_bullet_point(doc, 'Названии')
    add_bullet_point(doc, 'Бюджете')
    add_bullet_point(doc, 'Дедлайне')
    add_bullet_point(doc, 'Заказчике')
    add_bullet_point(doc, 'Статусе просмотра (не просмотрено, в работе, отказ)')
    
    add_heading(doc, '5.2. Детальный просмотр лота', 2)
    doc.add_paragraph(
        'При выборе лота из списка откроется детальная информация с доступными действиями:'
    )
    add_bullet_point(doc, '📥 Скачать документацию — если доступна ссылка на документацию')
    add_bullet_point(doc, '📎 Загрузить документацию — загрузить файл документации с компьютера')
    add_bullet_point(doc, '🧠 Анализ лота — запустить AI-анализ лота')
    add_bullet_point(doc, '🔙 Назад к списку — вернуться к списку лотов')
    
    add_heading(doc, '5.3. Статусы лотов', 2)
    doc.add_paragraph('Каждый лот может иметь один из следующих статусов просмотра:')
    add_bullet_point(doc, 'Не просмотрено — лот еще не был открыт')
    add_bullet_point(doc, 'В работе — лот взят в работу')
    add_bullet_point(doc, 'Отказ — от лота отказались')
    
    doc.add_paragraph(
        'Статус автоматически обновляется при открытии лота. Вы также можете изменить '
        'статус вручную, используя кнопки "В работу" или "Отказ" в детальном просмотре лота.'
    )
    
    add_heading(doc, '5.4. AI-анализ лота', 2)
    doc.add_paragraph(
        'Для анализа лота через AI нажмите кнопку "🧠 Анализ лота" в детальном просмотре. '
        'Бот отправит запрос в Perplexity AI и вернет структурированный анализ лота, включающий:'
    )
    add_bullet_point(doc, 'Оценку привлекательности закупки')
    add_bullet_point(doc, 'Рекомендации по участию')
    add_bullet_point(doc, 'Анализ бюджета с учетом накладных расходов')
    add_bullet_point(doc, 'Дополнительные замечания')
    
    doc.add_paragraph(
        'После получения анализа вы можете отправить его на email, нажав кнопку '
        '"📧 Отправить анализ на email".'
    )
    
    add_heading(doc, '5.5. Создание лота вручную', 2)
    doc.add_paragraph(
        'Для создания лота вручную нажмите кнопку "➕ Создать лот" в главном меню. '
        'Бот попросит вас ввести информацию о лоте:'
    )
    add_bullet_point(doc, 'Номер лота')
    add_bullet_point(doc, 'Название')
    add_bullet_point(doc, 'Описание')
    add_bullet_point(doc, 'Бюджет')
    add_bullet_point(doc, 'Дедлайн')
    add_bullet_point(doc, 'Заказчика')
    add_bullet_point(doc, 'Номенклатуру')
    
    doc.add_paragraph()
    
    # 6. Анализ коммерческих предложений
    add_heading(doc, '6. Анализ коммерческих предложений', 1)
    
    doc.add_paragraph(
        'Бот позволяет загружать и анализировать коммерческие предложения (КП) от поставщиков. '
        'Эта функция помогает сравнивать предложения и выбирать наиболее выгодные варианты.'
    )
    
    add_heading(doc, '6.1. Загрузка коммерческих предложений', 2)
    doc.add_paragraph('Для начала работы с КП:')
    add_numbered_point(doc, 'Нажмите кнопку "📄 Анализ КП" в главном меню')
    add_numbered_point(doc, 'Загрузите файл коммерческого предложения')
    
    doc.add_paragraph('Поддерживаемые форматы файлов:')
    add_bullet_point(doc, 'PDF')
    add_bullet_point(doc, 'DOCX, DOC')
    add_bullet_point(doc, 'TXT')
    add_bullet_point(doc, 'RTF')
    add_bullet_point(doc, 'Excel (XLSX, XLS)')
    
    add_heading(doc, '6.2. Автоматическое извлечение данных', 2)
    doc.add_paragraph(
        'После загрузки файла бот автоматически извлекает из него следующую информацию:'
    )
    add_bullet_point(doc, 'Название поставщика')
    add_bullet_point(doc, 'ИНН поставщика')
    add_bullet_point(doc, 'Сумма коммерческого предложения')
    add_bullet_point(doc, 'Количество наименований товара')
    
    doc.add_paragraph(
        'Если какие-то данные не удалось извлечь автоматически, бот попросит вас ввести их вручную.'
    )
    
    add_heading(doc, '6.3. Ввод транспортных расходов', 2)
    doc.add_paragraph(
        'После загрузки КП бот попросит указать транспортные расходы (стоимость доставки). '
        'Введите сумму в рублях или 0, если доставка не требуется.'
    )
    
    add_heading(doc, '6.4. Анализ надежности поставщика', 2)
    doc.add_paragraph(
        'После загрузки КП бот автоматически анализирует надежность поставщика через AI, '
        'используя информацию из базы данных и внешние источники. Результаты анализа включают:'
    )
    add_bullet_point(doc, 'Рейтинг надежности поставщика')
    add_bullet_point(doc, 'Информацию о надежности')
    add_bullet_point(doc, 'Интегральный рейтинг КП')
    
    add_heading(doc, '6.5. Формирование сравнительного отчета', 2)
    doc.add_paragraph(
        'После загрузки нескольких КП вы можете сформировать сравнительный отчет. '
        'Для этого нажмите кнопку "📊 Сформировать отчет сравнения" в меню анализа КП.'
    )
    
    doc.add_paragraph('Отчет включает:')
    add_bullet_point(doc, 'Список всех загруженных КП')
    add_bullet_point(doc, 'Информацию о поставщиках')
    add_bullet_point(doc, 'Стоимость товаров и доставки')
    add_bullet_point(doc, 'Количество наименований товара')
    add_bullet_point(doc, 'Рейтинги надежности')
    add_bullet_point(doc, 'Интегральные рейтинги')
    
    add_heading(doc, '6.6. Управление КП', 2)
    doc.add_paragraph('В меню анализа КП доступны следующие действия:')
    add_bullet_point(doc, '🔄 Загрузить новые КП — продолжить загрузку')
    add_bullet_point(doc, '🗑️ Очистить все КП — удалить все загруженные КП')
    
    doc.add_paragraph()
    
    # 7. Поиск поставщиков
    add_heading(doc, '7. Поиск поставщиков', 1)
    
    doc.add_paragraph(
        'Бот предоставляет возможность поиска поставщиков через AI и внешние API. '
        'Это помогает находить потенциальных поставщиков для ваших закупок.'
    )
    
    add_heading(doc, '7.1. Запуск поиска', 2)
    doc.add_paragraph('Для начала поиска поставщиков:')
    add_numbered_point(doc, 'Нажмите кнопку "🔍 Поиск Поставщиков" в главном меню')
    add_numbered_point(doc, 'Выберите метод поиска:')
    add_bullet_point(doc, 'Perplexity AI — поиск через AI')
    add_bullet_point(doc, 'Sniper Search — поиск через внешний API')
    
    add_heading(doc, '7.2. Способы ввода данных', 2)
    doc.add_paragraph('Вы можете ввести данные для поиска двумя способами:')
    
    add_paragraph_bold(doc, 'Ручной ввод:')
    doc.add_paragraph(
        'Введите название товара или описание того, что вы ищете. Например: '
        '"Болт М10х50" или "Перчатки рабочие".'
    )
    
    add_paragraph_bold(doc, 'Загрузка документа:')
    doc.add_paragraph(
        'Загрузите документ с перечнем товаров. Поддерживаются форматы: PDF, DOCX, Excel. '
        'Бот автоматически извлечет товары из документа и выполнит поиск для каждого.'
    )
    
    add_heading(doc, '7.3. Результаты поиска', 2)
    doc.add_paragraph(
        'После выполнения поиска бот отобразит список найденных поставщиков с информацией:'
    )
    add_bullet_point(doc, 'Название компании')
    add_bullet_point(doc, 'Контактная информация (email, телефон)')
    add_bullet_point(doc, 'Веб-сайт')
    add_bullet_point(doc, 'Описание товаров/услуг')
    
    add_heading(doc, '7.4. Формирование RFQ запросов', 2)
    doc.add_paragraph(
        'После поиска поставщиков вы можете сформировать запрос коммерческого предложения (RFQ). '
        'Бот создаст готовый текст запроса, который можно отправить поставщикам.'
    )
    
    doc.add_paragraph('RFQ запрос включает:')
    add_bullet_point(doc, 'Описание товаров/услуг')
    add_bullet_point(doc, 'Количество и единицы измерения')
    add_bullet_point(doc, 'Требуемую информацию от поставщика')
    add_bullet_point(doc, 'Контактные данные для ответа')
    
    doc.add_paragraph(
        'RFQ запросы отправляются на уникальные email адреса поставщиков, что исключает '
        'дублирование отправок одному и тому же поставщику.'
    )
    
    doc.add_paragraph()
    
    # 8. Настройки пользователя
    add_heading(doc, '8. Настройки пользователя', 1)
    
    doc.add_paragraph(
        'Бот позволяет настроить фильтры уведомлений и персональные предпочтения. '
        'Это помогает получать только релевантные уведомления о новых закупках.'
    )
    
    add_heading(doc, '8.1. Открытие настроек', 2)
    doc.add_paragraph(
        'Для открытия настроек нажмите кнопку "⚙️ Настройки" в главном меню. '
        'Откроется графическое меню с доступными опциями.'
    )
    
    add_heading(doc, '8.2. Выбор заказчиков', 2)
    doc.add_paragraph(
        'Вы можете настроить фильтр по заказчикам, чтобы получать уведомления только о '
        'закупках определенных организаций:'
    )
    add_numbered_point(doc, 'Нажмите "🏢 Выбрать заказчиков"')
    add_numbered_point(doc, 'Выберите нужных заказчиков из списка (можно выбрать несколько)')
    add_numbered_point(doc, 'Нажмите "✅ Сохранить"')
    
    add_heading(doc, '8.3. Выбор номенклатуры', 2)
    doc.add_paragraph(
        'Настройте фильтр по номенклатуре товаров/услуг:'
    )
    add_numbered_point(doc, 'Нажмите "🏷 Выбрать номенклатуру"')
    add_numbered_point(doc, 'Выберите нужные категории из списка')
    add_numbered_point(doc, 'Нажмите "✅ Сохранить"')
    
    add_heading(doc, '8.4. Управление уведомлениями', 2)
    doc.add_paragraph(
        'Для включения или выключения уведомлений:'
    )
    add_numbered_point(doc, 'Нажмите "🔔 Включить/Выключить уведомления"')
    add_numbered_point(doc, 'Используйте кнопку переключения для изменения статуса')
    
    doc.add_paragraph(
        'Уведомления работают только для пользователей с ролями "admin" и "manager". '
        'Также необходимо указать email адрес в настройках.'
    )
    
    add_heading(doc, '8.5. Настройка email', 2)
    doc.add_paragraph(
        'Для получения email уведомлений необходимо указать ваш email адрес. '
        'Это можно сделать через команду /set_email <ваш_email> или через настройки.'
    )
    
    doc.add_paragraph()
    
    # 9. Статистика
    add_heading(doc, '9. Статистика', 1)
    
    doc.add_paragraph(
        'Бот предоставляет подробную статистику по различным аспектам работы системы. '
        'Для просмотра статистики нажмите кнопку "📊 Статистика" в главном меню.'
    )
    
    add_heading(doc, '9.1. Статистика лотов', 2)
    doc.add_paragraph('Статистика включает:')
    add_bullet_point(doc, 'Общее количество лотов')
    add_bullet_point(doc, 'Количество активных лотов')
    add_bullet_point(doc, 'Количество закрытых лотов')
    add_bullet_point(doc, 'Общий бюджет всех лотов')
    add_bullet_point(doc, 'Статистика по статусам просмотра (не просмотрено, в работе, отказ)')
    
    add_heading(doc, '9.2. Статистика коммерческих предложений', 2)
    doc.add_paragraph('Статистика по КП включает:')
    add_bullet_point(doc, 'Общее количество загруженных КП')
    add_bullet_point(doc, 'Количество проанализированных КП')
    add_bullet_point(doc, 'Количество уникальных поставщиков')
    add_bullet_point(doc, 'Общая стоимость товаров')
    add_bullet_point(doc, 'Общая стоимость доставки')
    add_bullet_point(doc, 'Средние значения (цена, доставка, рейтинг)')
    add_bullet_point(doc, 'Количество наименований товара в КП')
    
    add_heading(doc, '9.3. Статистика поставщиков', 2)
    doc.add_paragraph('Статистика включает:')
    add_bullet_point(doc, 'Общее количество поставщиков в базе')
    add_bullet_point(doc, 'Количество поставщиков с рейтингом надежности')
    
    add_heading(doc, '9.4. Статистика пользователей', 2)
    doc.add_paragraph('Статистика включает:')
    add_bullet_point(doc, 'Общее количество пользователей')
    add_bullet_point(doc, 'Количество администраторов')
    add_bullet_point(doc, 'Количество менеджеров')
    
    doc.add_paragraph()
    
    # 10. Административные функции
    add_heading(doc, '10. Административные функции', 1)
    
    doc.add_paragraph(
        'Административные функции доступны только пользователям с ролью "admin". '
        'Для доступа к админ-панели нажмите кнопку "👑 Админ-панель" в главном меню.'
    )
    
    add_heading(doc, '10.1. Управление пользователями', 2)
    
    add_paragraph_bold(doc, 'Просмотр списка пользователей:')
    doc.add_paragraph('Используйте команду /users для просмотра всех зарегистрированных пользователей.')
    
    add_paragraph_bold(doc, 'Создание менеджера:')
    doc.add_paragraph('Используйте команду:')
    code_p = doc.add_paragraph('/set_manager_role <telegram_id> <email> <полное_имя>', style='No Spacing')
    code_run = code_p.runs[0]
    code_run.font.name = 'Courier New'
    code_run.font.size = Pt(10)
    
    add_paragraph_bold(doc, 'Изменение роли пользователя:')
    doc.add_paragraph('Используйте команду:')
    code_p = doc.add_paragraph('/set_role <telegram_id> <роль>', style='No Spacing')
    code_run = code_p.runs[0]
    code_run.font.name = 'Courier New'
    code_run.font.size = Pt(10)
    doc.add_paragraph('Доступные роли: user, manager, admin')
    
    add_heading(doc, '10.2. Управление системой', 2)
    doc.add_paragraph(
        'Администраторы могут управлять различными аспектами системы через админ-панель и команды.'
    )
    
    doc.add_paragraph()
    
    # 11. Решение проблем
    add_heading(doc, '11. Решение проблем', 1)
    
    add_heading(doc, '11.1. Бот не отвечает', 2)
    doc.add_paragraph('Если бот не отвечает на ваши сообщения:')
    add_bullet_point(doc, 'Проверьте подключение к интернету')
    add_bullet_point(doc, 'Убедитесь, что вы написали правильному боту')
    add_bullet_point(doc, 'Попробуйте отправить команду /start')
    add_bullet_point(doc, 'Обратитесь к администратору системы')
    
    add_heading(doc, '11.2. Команда не работает', 2)
    doc.add_paragraph('Если команда не выполняется:')
    add_bullet_point(doc, 'Проверьте правильность написания команды')
    add_bullet_point(doc, 'Убедитесь, что у вас есть права на выполнение команды')
    add_bullet_point(doc, 'Для админских команд необходима роль "admin"')
    add_bullet_point(doc, 'Проверьте, что вы зарегистрированы: /user_info')
    
    add_heading(doc, '11.3. Не приходят уведомления', 2)
    doc.add_paragraph('Если вы не получаете email уведомления:')
    add_bullet_point(doc, 'Проверьте, что у вас указан email адрес: /show_prefs')
    add_bullet_point(doc, 'Убедитесь, что уведомления включены')
    add_bullet_point(doc, 'Проверьте, что ваша роль — "admin" или "manager"')
    add_bullet_point(doc, 'Проверьте настройки фильтров (заказчики, номенклатура)')
    add_bullet_point(doc, 'Проверьте папку "Спам" в почтовом ящике')
    
    add_heading(doc, '11.4. Ошибка при загрузке файла', 2)
    doc.add_paragraph('Если файл не загружается:')
    add_bullet_point(doc, 'Проверьте формат файла (поддерживаются PDF, DOCX, DOC, TXT, RTF, Excel)')
    add_bullet_point(doc, 'Убедитесь, что размер файла не превышает ограничений Telegram (20 МБ)')
    add_bullet_point(doc, 'Попробуйте загрузить файл еще раз')
    add_bullet_point(doc, 'Если проблема сохраняется, обратитесь к администратору')
    
    add_heading(doc, '11.5. AI анализ не работает', 2)
    doc.add_paragraph('Если AI анализ не выполняется:')
    add_bullet_point(doc, 'Проверьте подключение к интернету')
    add_bullet_point(doc, 'Подождите несколько минут и попробуйте снова')
    add_bullet_point(doc, 'Обратитесь к администратору для проверки настроек API')
    
    doc.add_paragraph()
    
    # 12. Часто задаваемые вопросы
    add_heading(doc, '12. Часто задаваемые вопросы', 1)
    
    add_paragraph_bold(doc, 'Вопрос: Как узнать свой Telegram ID?')
    doc.add_paragraph(
        'Ответ: Отправьте команду /user_info боту, или найдите бота @userinfobot в Telegram '
        'и отправьте ему команду /start.'
    )
    
    add_paragraph_bold(doc, 'Вопрос: Можно ли использовать бота на нескольких устройствах?')
    doc.add_paragraph(
        'Ответ: Да, вы можете использовать бота на любом устройстве, где установлен Telegram. '
        'Ваши настройки и данные синхронизируются через базу данных.'
    )
    
    add_paragraph_bold(doc, 'Вопрос: Как часто обновляются лоты?')
    doc.add_paragraph(
        'Ответ: Парсер лотов запускается автоматически с интервалом, настроенным администратором '
        '(по умолчанию каждые 12 часов). Новые лоты появляются в системе после каждого запуска парсера.'
    )
    
    add_paragraph_bold(doc, 'Вопрос: Можно ли редактировать загруженные КП?')
    doc.add_paragraph(
        'Ответ: В текущей версии редактирование КП не поддерживается. Если необходимо изменить данные, '
        'очистите все КП и загрузите их заново.'
    )
    
    add_paragraph_bold(doc, 'Вопрос: Как экспортировать отчет сравнения КП?')
    doc.add_paragraph(
        'Ответ: В текущей версии экспорт в Excel/PDF не поддерживается. Отчет отображается только в боте. '
        'Вы можете скопировать текст отчета вручную.'
    )
    
    add_paragraph_bold(doc, 'Вопрос: Что делать, если забыл настройки?')
    doc.add_paragraph(
        'Ответ: Используйте команду /show_prefs для просмотра текущих настроек. '
        'Вы также можете открыть меню настроек через кнопку "⚙️ Настройки" в главном меню.'
    )
    
    doc.add_paragraph()
    
    # Заключение
    add_heading(doc, 'Заключение', 1)
    doc.add_paragraph(
        'Данная инструкция описывает основные функции и возможности телеграм-бота менеджера по закупкам РМКСИБ. '
        'Если у вас возникли вопросы или проблемы, не описанные в инструкции, обратитесь к администратору системы.'
    )
    
    doc.add_paragraph()
    doc.add_paragraph('Дата создания документа: 20 ноября 2025')
    doc.add_paragraph('Версия бота: 1.0')
    
    return doc

if __name__ == '__main__':
    doc = create_user_manual()
    output_file = 'Инструкция_пользователя_телеграм_бота_закупок.docx'
    doc.save(output_file)
    print(f'Инструкция сохранена в файл: {output_file}')

